# CircularFramingDiameter Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CircularFramingDiameter Property
ParameterTypeId Class See Also
---
"Circular Diameter"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CircularFramingDiameter { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CircularFramingDiameter As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CircularFramingDiameter {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace